#include <iostream>
#include <ctime>
#include <string>
#include <Windows.h>            // Русский язык
using std::string;
using std::cout;
using std::cin;
using std::endl;                // =)

class Hero // Зачем?)) // Возможно стоит объединить с лвлом // Типа учусь использовать классы))
{
public:
    string name, Class;
    int Hp, Level, Experience, Attack, Protection, Knowledge, Magic_Power, Gold, Mana, Cells_for_artifacts, Skills;
};

class Level // настройка лвлов и прибавки статов
{
public:
    string Class, Back;
    double Level, Experience, Required_experience = 100;
    double Hp, Attack, Protection, Knowledge, Magic_Power, Mana, Skill;
    int Gold;
    double Hp_Max;
    void Working_with_experience() {
        if (Experience >= Required_experience)
        {
            Level += 1;
            Experience -= Required_experience;
            Required_experience = Level * 100;
            if (Class == "Воин")         // прирост статов (возможны изменения)
            {
                Hp_Max += (Level * 12);
                Attack += (Level * 6);
                Protection += (Level * 8);
                Knowledge += (Level * 2);
                Magic_Power += (Level * 2);
                Mana += (Level * 2);
                Skill += 1;
            }
            else if (Class == "Лучник")   // прирост статов (возможны изменения)
            {
                Hp_Max += (Level * 8);
                Attack += (Level * 8);
                Protection += (Level * 4);
                Knowledge += (Level * 4);
                Magic_Power += (Level * 4);
                Mana += (Level * 4);
                Skill += 1;
            }
            else if (Class == "Маг")   // прирост статов (возможны изменения)
            {
                Hp_Max += (Level * 4);
                Attack += (Level * 2);
                Protection += (Level * 2);
                Knowledge += (Level * 6);
                Magic_Power += (Level * 12);
                Mana += (Level * 10);
                Skill += 1;
            }
        }
    }
    void characteristics() {
        system("cls");
        cout << "--------------------------" << "\n";       // Типо красиво оформил
        cout << "Данные персонажа  \t" << " | " << "\n";    // А как по другому?)
        cout << "Вы выбрали класс " << Class << "\t" << " | " << "\n";
        cout << "Здоровье = " << Hp << "\t" << "         | " << "\n";
        cout << "Уровень = " << Level << "\t" << "         | " << "\n";
        cout << "Опыт = " << Experience << "\t" << "         | " << "\n";
        cout << "Атака = " << Attack << "\t" << "         | " << "\n";
        cout << "Защита = " << Protection << "\t" << "         | " << "\n";
        cout << "Знания = " << Knowledge << "\t" << "         | " << "\n";
        cout << "Магическая сила = " << Magic_Power << "\t" << " | " << "\n";
        cout << "Золото = " << Gold << "\t" << "         | " << "\n";
        cout << "Мана = " << Mana << "\t" << "         |" << "\n";
        cout << "Очки навыков = " << Skill << "\t" << " | " << "\n";
        cout << "--------------------------" << "\n";
        cout << "\n";
        cout << "Ваши следующие действия: " << "\n";
        cout << "Спросить торговца о другом - 1 " << "\n";
        cout << "Вернуться  - 2 " << "\n";
        cin >> Back;

        for (size_t i = 0; i < 1; i++)
        {
            if (Back == "1")
            {
                Back = "1";
                break;
            }
            if (Back == "2")
            {
                Back = "2";
                break;
            }
            else
            {
                cout << "\n";
                cout << "Ошибка!!! " << "\n";
                cout << "Выберите один из четырёх вариантов " << "\n";
                cout << "Используя целые числа в диапазоне от 1 до 2 " << "\n";
                i--;
            }
        }
    }
};
// Геймплей (выбор маршрута)  // в разработке
class Travelling                   // Выбор дальнейших действий
{
public:
    string choice_1, choice_2, choice_3, tavern;
    int Route_selection() {
        for (size_t i = 0; i < 1; i++)
        {
            string Button;
            cout << "Вы стоите у путеводного камня, выберите ваше следующее действие: " << "\n";
            cout << "Посетить таверну - 1 " << "\n";
            cout << "Отправиться в путешествие - 2 " << "\n";
            cout << "Выход из игры - 3 " << "\n";
            cout << "Выбор: ";
            cin >> Button;
            tavern = Button;
            if (Button == "1")     // Таверна и её фишки
            {
                for (size_t v = 0, s = 0; v < 1; v++)
                {
                    if (s < 1)
                    {
                        system("cls");
                    }
                    cout << "Вы заходите в таверну и понимаете, что у вас есть следующие возможности:" << "\n";
                    cout << "Торговля - 2" << "\n";
                    cout << "Отдых - 3" << "\n";
                    cout << "Вернуться к путеводному камню - 4" << "\n";
                    cout << "Ваши действия: ";
                    cin >> choice_1;
                    //
                    if (choice_1 == "1")
                    {
                        cout << "\n";
                        cout << "Вы принимаете решение заручиться помощью новых союзников " << "\n";
                        break;
                    }
                    else if (choice_1 == "2")
                    {
                        cout << "\n";
                        cout << "Вы решаете заняться торговлей" << "\n";
                        break;
                    }
                    else if (choice_1 == "3")
                    {
                        cout << "\n";
                        cout << "Вы решили отдохнуть" << "\n";
                        break;
                    }
                    else if (choice_1 == "4")
                    {
                        cout << "\n";
                        cout << "Вы решили вернуться к путеводному камню" << "\n";
                        break;
                    }
                    else
                    {
                        cout << "\n";
                        cout << "Ошибка!!! " << "\n";
                        cout << "Выберите один из четырёх вариантов " << "\n";
                        cout << "Используя целые числа в диапазоне от 1 до 4 " << "\n";
                        v--;
                        s++;
                    }
                }
                //
                break; // Можно и убрать =)
            }
            else if (Button == "2") // Приключения
            {
                for (size_t v = 0, s = 0; v < 1; v++)
                {
                    if (s < 1)
                    {
                        system("cls");
                    }
                    cout << "Вы отправляетесь в путешествие:" << "\n";
                    cout << "В таверну - 1" << "\n";
                    cout << "В подземелье - 2" << "\n";
                    cout << "Вернуться к путеводному камню - 4" << "\n";
                    cout << "Ваши действия: ";
                    cin >> choice_2;
                    //
                    if (choice_2 == "1")
                    {
                        cout << "\n";
                        cout << "Вы принимаете решение отправиться в таверну " << "\n";
                        break;
                    }
                    else if (choice_2 == "2")
                    {
                        cout << "\n";
                        cout << "Вы решаете отправиться в подземелье " << "\n";
                        break;
                    }
                    else if (choice_2 == "3")
                    {
                        cout << "\n";
                        cout << "Вы решаете отправиться на сбор ресурсов" << "\n";
                        break;
                    }
                    else if (choice_2 == "4")
                    {
                        cout << "\n";
                        cout << "Вы решили вернуться к путеводному камню" << "\n";
                        break;
                    }
                    else
                    {
                        cout << "\n";
                        cout << "Ошибка!!! " << "\n";
                        cout << "Выберите один из четырёх вариантов " << "\n";
                        cout << "Используя целые числа в диапазоне от 1 до 4 " << "\n";
                        v--;
                        s++;
                    }
                }
                //
                break;
            }
            else if (Button == "3") // Наигрался?
            {
                system("cls");
                cout << " ---------------------" << "\n";
                cout << "  Спасибо за игру !!! " << "\n";
                cout << " ---------------------" << "\n";
                choice_3 = "3";
                return 0;
                break;
            }
            else
            {
                cout << "Ошибка!!! " << "\n";
                cout << "Выберите один из трёх вариантов " << "\n";
                cout << "Используя целые числа в диапазоне от 1 до 3 " << "\n";
                i--;
            }
        }
    }
};
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////////////
class Tavern        // Функционал таверны (торговля, реген hp, найм)
{
public:
    int l = 0;
    int Button;
    int Talent;
    int money_from_junk = 0;
    int junk[4] { 0,1,2,3 };
    int help_with_junk[4]{0,0,0,0};
    int Gold, Mana_Bottle = 0, Health_Bottle = 0, Average_Potion_hp = 0, Medium_Mana_Potion = 0, Large_Mana_Potion = 0, Big_Potion_hp = 0, Flame_Potion = 0, Tide_Potion = 0; // Голда и фласки
    string Class;
    string Warrior_Talents, Archer_Talents, Mage_Talents;
    string Back; // Возможно будет удаленно и упрощенно)))
    string Mana_Potion, Health_Potion; // Зелье маны // Зелье hp
    string choice_1, choice_2, choice_3, choice_4, choice_5;  // Действия // Слишком много - надо удалять
    void Trade() {
        if (l == 0)
        {
            system("cls");
        }
        if (l != 0)
        {
            cout << "\n";
            cout << "----------------------------------------------------------------------" << "\n";
            l = 0;
        }
        cout << "Как вы хотите провзаимодействовать с торговцем: " << "\n";
        cout << "Продать ненужные вещи - 1" << "\n";
        cout << "Найм отрядов  - 2" << "\n";
        cout << "Использовать очки талантов  - 3" << "\n";
        cout << "Узнать свои характеристики  - 4" << "\n";
        cout << "Вернуться в главный зал - 5" << "\n";
        cout << "Ваши действия: " << "\n";
        cin >> choice_1;
        // Торговля
        for (size_t i = 0; i < 1; i++)
        {
            if (choice_1 == "1")
            {
                system("cls");
                cout << "Вы смотрите в свои сумки и видите там:  " << "\n";   // n кол-во вещей // реализовать в классе золото))
                for (int i = 0; i < sizeof(junk)/sizeof(junk [0]); i++)
                {
                    if (junk[i] == junk[0])
                    {
                        Button = help_with_junk[0];
                        cout << "Ягод: " << Button <<"\t\t\t" << "  | 10 Ягод - 1 золотая " << "\n";
                    }
                    else if (junk[i] == junk[1])
                    {
                        Button = help_with_junk[1];
                        cout << "Трав: " << Button << "\t\t\t" << "  | 5 Трав - 10 золотых " << "\n";
                    }
                    else if (junk[i] == junk[2])
                    {
                        Button = help_with_junk[2];
                        cout << "Шкуры животных: " << Button << "\t" << "  | 1 Шкура - 25 золотых " << "\n";
                    }
                    else if (junk[i] == junk[3])
                    {
                        Button = help_with_junk[3];
                        cout << "Минералы: " << Button << "\t\t" << "  | 1 Минерал - 100 золотых " "\n";
                    }
                }
                cout << "Ваши действия: " << "\n";
                cout << "Продать все ненужные вещи - 1 " << "\n";
                cout << "Посмотреть другие функции торговца - 2 " << "\n";   // возврат
                cin >> choice_2;
                // Функции торгаша
                for (size_t v = 0; v < 1; v++) // продажа вещей
                {
                    if (choice_2 == "1")
                    {
                        for (int y = 0; y < sizeof(junk) / sizeof(junk[0]); y++)
                        {
                            for (size_t u = 0; u < 1; u++)
                            {
                                if (junk[y] == junk[0])
                                {
                                    if (junk[0] >= 10)
                                    {
                                        junk[0] -= 10;
                                        Gold += 1;
                                        money_from_junk += 1;
                                        u--;
                                    }
                                }
                            }
                            for (size_t u_1 = 0; u_1 < 1; u_1++)
                            {
                                if (junk[y] == junk[1])
                                {
                                    if (junk[0] >= 5)
                                    {
                                        junk[0] -= 5;
                                        Gold += 10;
                                        money_from_junk += 10;
                                        u_1--;
                                    }
                                }
                            }
                            for (size_t u_2 = 0; u_2 < 1; u_2++)
                            {
                                if (junk[y] == junk[2])
                                {
                                    if (junk[0] >= 1)
                                    {
                                        junk[0] -= 1;
                                        Gold += 25;
                                        money_from_junk += 25;
                                        u_2--;
                                    }
                                }
                            }
                            for (size_t u_3 = 0; u_3 < 1; u_3++)
                            {
                                if (junk[y] == junk[3])
                                {
                                    if (junk[0] >= 1)
                                    {
                                        junk[0] -= 1;
                                        Gold += 100;
                                        money_from_junk += 100;
                                        u_3--;
                                    }
                                }
                            }
                        }
                        for (size_t p = 0; p < 1; p++)
                        {
                            system("cls");
                            cout << "Вы продаете вещи и получаете за это: " << money_from_junk <<" золотых монет" << "\n";  // добавить золото
                            cout << "Ваши дальнейшие действия: " << "\n";
                            cout << "Спросить про другие возможности торговца - 1 " << "\n";
                            cout << "Вернуться в главный зал - 2 " << "\n";
                            cout << "Ваши действия: " << "\n";
                            money_from_junk = 0;
                            cin >> Back;
                            //
                            if (Back == "1")
                            {
                                Back = "1";
                                cout << "Вы решили спросить про другие возможности торговца " << "\n"; // Хм... А не легче убрать Back и заменить его на счетчик цикла?))
                                break;
                            }
                            else if (Back == "2")
                            {
                                Back = "2";
                                cout << "Вы решили вернуться в главный зал " << "\n";
                                break;
                            }
                            else
                            {
                                cout << "Ошибка!!! " << "\n";
                                cout << "Выберите один из двух вариантов " << "\n";
                                cout << "Используя целые числа в диапазоне от 1 до 2 " << "\n";
                                p--;
                            }
                        }
                    }
                    else if (choice_2 == "2") // возврат
                    {
                        cout << "Вы решаете узнать о других возможностях торговца " << "\n";
                        Back = "1";
                        break;
                    }
                    else
                    {
                        cout << "Ошибка!!! " << "\n";
                        cout << "Выберите один из двух вариантов " << "\n";
                        cout << "Используя целые числа в диапазоне от 1 до 2 " << "\n";
                        v--;
                    }
                }
            }
            else if (choice_1 == "2")
            {
                for (size_t m = 0; m < 1; m++)
                {
                    system("cls");
                    cout << "У вас следующий выбор юнитов:" << "\n"; // реализовать
                    cout << "Юниты человеческой расы" << "\n";
                    cout << "Прочие расы" << "\n";
                    cout << "Ваши действия: " << "\n";
                    cout << "Узнать о первых - 1" << "\n";
                    cout << "Узнать о вторых - 2" << "\n";
                    cout << "Спросить про другие возможности торговца - 3" << "\n";
                    cout << "Вернуться в главный зал - 4" << "\n";
                    cin >> choice_3;
                    //
                    for (size_t p = 0; p < 1; p++)
                    {
                        if (choice_3 == "1") // Хилки
                        {
                            system("cls");
                            cout << "Вы видите следующие отряды: " << "\n";
                            cout << "Маленькое отряд пехотинцев -   150 hp | 25 атаки | 100 золотых" << "\n";
                            cout << "Отряд лучников             -    85 hp | 75 атаки | 125 золотых" << "\n";
                            cout << "Паладин                    -   280 hp | 50 атаки | 485 золотых" << "\n";
                            cout << "Рыцарь смерти              -   850 hp | 100 атаки| 1000 золотых" << "\n";
                            cout << "Ваши действия: " << "\n";
                            cout << "Нанять маленький отряд пехоты - 1" << "\n";
                            cout << "Нанять отряд лучников - 2" << "\n";
                            cout << "Нанять паладина - 3" << "\n";
                            cout << "Нанять рыцаря смерти - 4" << "\n";
                            cout << "Спросить про другие возможности торговца - 5" << "\n";
                            cout << "Вернуться в главный зал - 6" << "\n";
                            cin >> Health_Potion;
                            if (Health_Potion == "1")
                            {
                                if (Gold >= 100)
                                {
                                    Gold -= 100;
                                    Health_Bottle += 1;
                                    cout << "Вы наняли один отряд пехоты" << "\n"; // Можно ещё реализовать покупку количества по выбору пользователя
                                    system("PAUSE");
                                    m--;
                                }
                                else
                                {
                                    cout << "У вас не хватает денег" << "\n";
                                    system("PAUSE");
                                    m--;
                                }
                            }
                            else if (Health_Potion == "2")
                            {
                                if (Gold >= 125)
                                {
                                    Gold -= 125;
                                    Average_Potion_hp += 1;
                                    cout << "Вы наняли один отряд лучников" << "\n"; // Можно ещё реализовать покупку количества по выбору пользователя
                                    system("PAUSE");
                                    m--;
                                }
                                else
                                {
                                    cout << "У вас не хватает денег" << "\n";
                                    system("PAUSE");
                                    m--;
                                }
                            }
                            else if (Health_Potion == "3")
                            {
                                if (Gold >= 485)
                                {
                                    Gold -= 485;
                                    Big_Potion_hp += 1;
                                    cout << "Вы наняли паладина" << "\n"; // Можно ещё реализовать покупку количества по выбору пользователя
                                    system("PAUSE");
                                    m--;
                                }
                                else
                                {
                                    cout << "У вас не хватает денег" << "\n";
                                    system("PAUSE");
                                    m--;
                                }
                            }
                            else if (Health_Potion == "4")
                            {
                                if (Gold >= 1000)
                                {
                                    Gold -= 1000;
                                    Flame_Potion += 1;
                                    cout << "Вы наняли рыцаря смерти" << "\n"; // Можно ещё реализовать покупку количества по выбору пользователя
                                    system("PAUSE");
                                    m--;
                                }
                                else
                                {
                                    cout << "У вас не хватает денег" << "\n";
                                    system("PAUSE");
                                    m--;
                                }
                            }
                            else if (Health_Potion == "5")
                            {
                                cout << "Вы решаете узнать о других возможностях торговца " << "\n";
                                system("PAUSE");
                                m--;
                            }
                            else if (Health_Potion == "6")
                            {
                                cout << "Вы решили вернуться в главный зал  " << "\n";
                                system("PAUSE");
                                Back = "2";
                                m--;
                            }
                            else
                            {
                                cout << "Ошибка!!! " << "\n";
                                cout << "Выберите один из шести вариантов " << "\n";
                                cout << "Используя целые числа в диапазоне от 1 до 6 " << "\n";
                                system("PAUSE");
                                p--;
                            }
                        }
                        else if (choice_3 == "2") // Мана
                        {
                            for (size_t b = 0; b < 1; b++)
                            {
                                system("cls");
                                cout << "Вы видите следующие отряды: " << "\n";
                                cout << "мурлок  -      20 hp   | 15 атаки   | 20 золотых" << "\n";
                                cout << "Орк      -     280 hp  | 35 атаки   | 280 золотых" << "\n";
                                cout << "Огр      -     780 hp  | 125 атаки  | 800 золотых" << "\n";
                                cout << "Гронн -        1200 hp | 185 атаки  | 1200 золотых" << "\n";
                                cout << "Ваши действия: " << "\n";
                                cout << "Нанять мурлока - 1" << "\n";
                                cout << "Нанять Орка - 2" << "\n";
                                cout << "Нанять Огра - 3" << "\n";
                                cout << "Нанять Гронна - 4" << "\n";
                                cout << "Спросить про другие возможности торговца - 5" << "\n";
                                cout << "Вернуться в главный зал - 6" << "\n";
                                cin >> Mana_Potion;
                                //
                                if (Mana_Potion == "1")
                                {
                                    if (Gold >= 20)
                                    {
                                        Gold -= 20;
                                        Mana_Bottle += 1;
                                        cout << "Вы купили одно маленькое зелье маны" << "\n"; // Можно ещё реализовать покупку количества по выбору пользователя
                                        system("PAUSE");
                                        m--;
                                    }
                                    else
                                    {
                                        cout << "У вас не хватает денег" << "\n";
                                        system("PAUSE");
                                        m--;
                                    }
                                }
                                else if (Mana_Potion == "2")
                                {
                                    if (Gold >= 280)
                                    {
                                        Gold -= 280;
                                        Medium_Mana_Potion += 1;
                                        cout << "Вы купили одно среднее зелье маны" << "\n"; // Можно ещё реализовать покупку количества по выбору пользователя
                                        system("PAUSE");
                                        m--;
                                    }
                                    else
                                    {
                                        cout << "У вас не хватает денег" << "\n";
                                        system("PAUSE");
                                        m--;
                                    }
                                }
                                else if (Mana_Potion == "3")
                                {
                                    if (Gold >= 800)
                                    {
                                        Gold -= 800;
                                        Large_Mana_Potion += 1;
                                        cout << "Вы купили одно большое зелье маны" << "\n"; // Можно ещё реализовать покупку количества по выбору пользователя
                                        system("PAUSE");
                                        m--;
                                    }
                                    else
                                    {
                                        cout << "У вас не хватает денег" << "\n";
                                        system("PAUSE");
                                        m--;
                                    }
                                }
                                else if (Mana_Potion == "4")
                                {
                                    if (Gold >= 1200)
                                    {
                                        Gold -= 1200;
                                        Tide_Potion += 1;
                                        cout << "Вы купили одно зелье приливов" << "\n"; // Можно ещё реализовать покупку количества по выбору пользователя
                                        system("PAUSE");
                                        m--;
                                    }
                                    else
                                    {
                                        cout << "У вас не хватает денег" << "\n";
                                        system("PAUSE");
                                        m--;
                                    }
                                }
                                else if (Health_Potion == "5")
                                {
                                    cout << "Вы решаете узнать о других возможностях торговца " << "\n";
                                    Back = "1";
                                    break;
                                }
                                else if (Health_Potion == "6")
                                {
                                    cout << "Вы решили вернуться в главный зал  " << "\n";
                                    Back = "2";
                                    break;
                                }
                                else
                                {
                                    cout << "Ошибка!!! " << "\n";
                                    cout << "Выберите один из шести вариантов " << "\n";
                                    cout << "Используя целые числа в диапазоне от 1 до 6 " << "\n";
                                    system("PAUSE");
                                    b--;
                                }
                            }
                        }
                        else if (choice_3 == "3")
                        {
                            cout << "Вы решаете узнать о других возможности торговца " << "\n";
                            Back = "1";
                            break;
                        }
                        else if (choice_3 == "4")
                        {
                            cout << "Вы решили вернуться в главный зал таверны " << "\n";
                            Back = "2";
                            break;
                        }
                        else
                        {
                            cout << "Ошибка!!! " << "\n";
                            cout << "Выберите один из четырёх вариантов " << "\n";
                            cout << "Используя целые числа в диапазоне от 1 до 4 " << "\n";
                            system("PAUSE");
                            m--;
                        }
                    }
                }
            }
                //
            else if (choice_1 == "3")
            {
                if (Talent == 1)
                {
                    cout << "\n";
                    cout << "Вы видите следующий список талантов: " << "\n";   // реализовать в классе талантов))
                    if (Class == "Воин")
                    {
                        for (size_t Or = 0; Or < 1; Or++)
                        {
                            cout << "Щит спасения - 1" << "\n";
                            cout << "Поднять щиты - 2" << "\n";
                            cout << "Вихрь - 3" << "\n";
                            cout << "Победный раж - 4" << "\n";
                            cout << "Удар колосса - 5" << "\n";
                            cout << "\n";
                            cout << "Выберите способность для прокачки" << "\n";
                            cin >> Warrior_Talents;
                            if (Warrior_Talents == "1" || Warrior_Talents == "2" || Warrior_Talents == "3" || Warrior_Talents == "4" || Warrior_Talents == "5")
                            {
                            }
                            else
                            {
                                Or--;
                                system("Pause");
                                system("cls");
                            }
                        }
                    }
                    if (Class == "Лучник")
                    {
                        for (size_t Or = 0; Or < 1; Or++)
                        {
                            cout << "Щит спасения   - 1" << "\n";
                            cout << "Поднять щиты   - 2" << "\n";
                            cout << "Меткий выстрел - 3" << "\n";
                            cout << "снайперский выстрел  - 4" << "\n";
                            cout << "Убийственный выстрел - 5" << "\n";
                            cout << "\n";
                            cout << "Выберите способность для прокачки" << "\n";
                            cin >> Archer_Talents;
                            if (Archer_Talents == "1" || Archer_Talents == "2" || Archer_Talents == "3" || Archer_Talents == "4" || Archer_Talents == "5")
                            {
                            }
                            else
                            {
                                Or--;
                                system("Pause");
                                system("cls");
                            }
                        }
                    }
                    if (Class == "Маг")
                    {
                        for (size_t Or = 0; Or < 1; Or++)
                        {
                            cout << "Щит спасения  - 1" << "\n";
                            cout << "Поднять щиты - 2" << "\n";
                            cout << "Испепеление - 3" << "\n";
                            cout << "стрела опустошения - 4" << "\n";
                            cout << "Стрела хаоса - 5" << "\n";
                            cout << "\n";
                            cout << "Выберите способность для прокачки" << "\n";
                            cin >> Mage_Talents;
                            if (Mage_Talents == "1" || Mage_Talents == "2" || Mage_Talents == "3" || Mage_Talents == "4" || Mage_Talents == "5")
                            {
                            }
                            else
                            {
                                Or--;
                                system("Pause");
                                system("cls");
                            }
                        }
                    }
                    Talent -= 1;
                    system("Pause");
                    system("cls");
                    Back = "1";
                }
                else
                {
                    cout << "У вас нет очков для прокачки талантов" << "\n";
                    system("Pause");
                    system("cls");
                    Back = "1";
                }
                break;
            }
            else if (choice_1 == "4")
            {
                cout << "\n";
                cout << "Ваши характеристики:" << "\n";  // реализовать
                break;
            }
            else if (choice_1 == "5")
            {
                cout << "\n";
                cout << "Вы решили вернуться в главный зал" << "\n";  // реализовать
                Back = "2";
                break;
            }
            else
            {
                cout << "\n";
                cout << "Ошибка!!! " << "\n";
                cout << "Выберите один из пяти вариантов " << "\n";
                cout << "Используя целые числа в диапазоне от 1 до 5 " << "\n";
                system("PAUSE");
                i--;
            }
        }
    }
};

class tavern        // Функционал таверны (торговля, реген hp, найм)
{
public:
    string Back, choice_1; // choice_2, choice_3, choice_4, choice_5, Talents, Specifications; - Остались с прошлой работы)
    void Trips_to_the_tavern () {
        cout << "Вы заходите в таверну и понимаете, что у вас есть следующие возможности:" << "\n";
        cout << "Торговля - 1" << "\n";
        cout << "Отдых - 2" << "\n";
        cout << "Вернуться к путеводному камню - 3" << "\n";
        cout << "Ваши действия: ";
        cin >> choice_1;
        //
        for (size_t i = 0; i < 1; i++)
        {
            if (choice_1 == "1")
            {
                cout << "\n";
                cout << "Вы решаете заняться торговлей" << "\n";
                choice_1 == "1";
                break;
            }
            else if (choice_1 == "2")
            {
                cout << "\n";
                cout << "Вы решили отдохнуть" << "\n";
                choice_1 == "2";
                break;
            }
            else if (choice_1 == "3")
            {
                cout << "\n";
                cout << "Вы решили вернуться к путеводному камню" << "\n";
                choice_1 = "3";
                break;
            }
            else
            {
                cout << "\n";
                cout << "Ошибка!!! " << "\n";
                cout << "Выберите один из трёх вариантов " << "\n";
                cout << "Используя целые числа в диапазоне от 1 до 3 " << "\n";
                i--;
            }
        }
    }
};

int main()
{
    setlocale(LC_ALL, "Russian");
    system("chcp 1251");
    Hero Hero;
    Level Level;
    Travelling Travelling;
    Tavern Tavern;
    tavern tavern;
        // Русский язык
    cout << "Введите имя: ";       // name  // трабл с пробелами
    cin >> Hero.name;              // name  //трабл с пробелами
    cout << "Выберите класс за которые хотите играть" << "\n";
    for (size_t i = 0; i < 1; i++)
    {
        string Button;
        cout << "Воин - 1" << "\t" << "| атака - 20" << "\t" << "| Защита = 35" << "\t" << "| Магическая Сила = 5" << "\n";
        cout << "Лучник - 2" << "\t" << "| атака - 35" << "\t" << "| Защита = 15" << "\t" << "| Магическая Сила = 10" << "\n";
        cout << "Маг - 3  " << "\t" << "| атака - 15" << "\t" << "| Защита = 5" << "\t" << "| Магическая Сила = 35" << "\n";
        cout << "Выбор: ";
        cin >> Button;
        if (Button == "1")    // Выбор класса
        {                     // Трабл с оператором switch при использовании символьного ввода !!!
            Hero.Class = "Воин";
            break;
        }
        else if (Button == "2")
        {
            Hero.Class = "Лучник";
            break;
        }
        else if (Button == "3")
        {
            Hero.Class = "Маг";
            break;
        }
        else
        {
            cout << "Ошибка!!! " << "\n";
            cout << "Выберите один из трёх классов " << "\n";
            cout << "Используя целые числа в диапазоне от 1 до 3 " << "\n";
            i--;
        }
    }
    system("cls"); // чистим консоль
    // cout <<Hero.name << " теперь вы: " << Hero.Class << "\n";            // -_-

    if (Hero.Class == "Воин")
    {
        Hero.Hp = 120;    // повышенное хп (воин)
        Hero.Level = 1;   // 1 уровень
        Hero.Experience = 0;  // опыта = 0
        Hero.Attack = 20;     // Атака = 20
        Hero.Protection = 35; // Защита = 35
        Hero.Knowledge = 5;   // Знания = 5
        Hero.Magic_Power = 5; // Магическая Сила = 5
        Hero.Gold = 200;      // Золото = 200
        Hero.Mana = 10;        // Мана = 0 (возможно будет добавлена ярость на замену)
        Hero.Skills = 1;      // одно очко для прокачки таланта     // Ещё в разработке
    }
    else if (Hero.Class == "Лучник")
    {
        Hero.Hp = 100;    // хп
        Hero.Level = 1;   // 1 уровень
        Hero.Experience = 0;  // опыта = 0
        Hero.Attack = 35;     // Атака = 35
        Hero.Protection = 15; // Защита = 15
        Hero.Knowledge = 10;   // Знания = 10
        Hero.Magic_Power = 10; // Магическая Сила = 10
        Hero.Gold = 200;      // Золото = 200
        Hero.Mana = 50;        // Мана = 50
        Hero.Skills = 1;      // одно очко для прокачки таланта  // Ещё в разработке
    }
    else if (Hero.Class == "Маг")
    {
        Hero.Hp = 100;    // хп
        Hero.Level = 1;   // 1 уровень
        Hero.Experience = 0;  // опыта = 0
        Hero.Attack = 15;     // Атака = 15
        Hero.Protection = 5; // Защита = 5
        Hero.Knowledge = 25;   // Знания = 25
        Hero.Magic_Power = 35; // Магическая Сила = 35
        Hero.Gold = 200;      // Золото = 200
        Hero.Mana = 100;        // Мана = 100
        Hero.Skills = 1;      // одно очко для прокачки таланта           // Ещё в разработке
    }
    else
    {
        cout << "Ошибка!!! " << "\n";
        cout << "Как так вышло? " << "\n";
        return 0;
    }

    cout << "--------------------------" << "\n";       // Типо красиво оформил
    cout << "Данные персонажа  \t" << " | " << "\n";    // А как по другому?)
    cout << "Вы выбрали класс " << Hero.Class << "\t" << " | " << "\n";
    cout << "Здоровье = " << Hero.Hp << "\t" << "         | " << "\n";
    cout << "Уровень = " << Hero.Level << "\t" << "         | " << "\n";
    cout << "Опыт = " << Hero.Experience << "\t" << "         | " << "\n";
    cout << "Атака = " << Hero.Attack << "\t" << "         | " << "\n";
    cout << "Защита = " << Hero.Protection << "\t" << "         | " << "\n";
    cout << "Знания = " << Hero.Knowledge << "\t" << "         | " << "\n";
    cout << "Магическая сила = " << Hero.Magic_Power << "\t" << " | " << "\n";
    cout << "Золото = " << Hero.Gold << "\t" << "         | " << "\n";
    cout << "Мана = " << Hero.Mana << "\t" << "         |" << "\n";
    cout << "Очки навыков = " << Hero.Skills << "\t" << " | " << "\n";
    cout << "--------------------------" << "\n";
    cout << "\n";

    // работа с лвлами и статами

    Level.Class = Hero.Class;             // передача данных о выбранном классе
    Level.Hp = Hero.Hp;                   // передача данных о hp
    Level.Level = Hero.Level;             // передача данных о уровне
    Level.Experience = Hero.Experience;   // передача данных о опыте
    Level.Attack = Hero.Attack;           // передача данных о атаке
    Level.Protection = Hero.Protection;   // передача данных о защите
    Level.Knowledge = Hero.Knowledge;     // передача данных о знаниях
    Level.Magic_Power = Hero.Magic_Power; // передача данных о магической силе
    Level.Mana = Hero.Mana;               // передача данных о мане
    Level.Skill = Hero.Skills;            // передача данных о навыках

    Tavern.Gold = Hero.Gold;
    Tavern.Class = Hero.Class;
    Tavern.Talent = Hero.Level;
    /* Level.Experience = 800;
       Level.Working_with_experience();      // Тест опыта =)  // Не буди его)
       cout << Level.Level <<"\n";  */
    int i = 0;
    while (i < 1)
    {
        string Rot;
        string Amar;
        i++;
        for (size_t r = 0; r < 1; r++)
        {
            Travelling.Route_selection(); // Начало пути // Путеводных камень и пути от него
            //
            if (Travelling.choice_1 == "4" || Travelling.choice_2 == "4")
            {
                // Реализация возврата к камню
                Travelling.choice_1 = "0";
                Travelling.choice_2 = "0";
            }
        }
        if (tavern.choice_1 == "2" || Travelling.choice_1 == "3") // Типо реген хп
        {
            tavern.choice_1 == "0";
            Level.Hp = Level.Hp_Max;
            cout << "Вы отдохнули и направляетесь к торговцу \n";
            system("Pause");

        }
        if (Travelling.choice_2 == "2")
        {
            Travelling.choice_2 = "0";
            cout << "Выберите сложность подземелья:" "\n";
            cout << "Легкое - 1" "\n";
            cout << "Среднее - 2" "\n";
            cout << "Сложное - 3" "\n";
            cin >> Amar;
            if (Amar == "1")
            {
                cout << "На вас напал огромный огр!!!" "\n";
                cout << "Огр 50 HP | 5 атаки" "\n";
                cout << "Вы победили!!!))) - 10 Hp" "\n";
                Level.Hp -= -10;
                Level.Experience += 50;
                Tavern.junk[0] += 20;
                Tavern.junk[1] += 10;
                Tavern.junk[2] += 5;
                Tavern.junk[3] += 1;
                Rot = "1";

            }
            if (Amar == "2")
            {
                if (Level.Level < 5)
                {
                    cout << "\n";
                    cout << "Вам ещё рано" "\n";
                }
            }
            if (Amar == "3")
            {
                if (Level.Level < 15)
                {
                    cout << "\n";
                    cout << "Вам ещё рано" "\n";
                }
            }
        }
        for (size_t q = 0, Q = 0; q < 1; q++)
        {
            if (Travelling.choice_2 == "1" || Q == 1 || Rot == "1") //|| tavern.choice_1 == "2")   // Путешествие в таверну
            {
                Travelling.choice_2 = "0";
                Rot = "0";
                // tavern.choice_1 = "0";
                tavern.Trips_to_the_tavern(); // функции таверны
                if (tavern.choice_1 == "3")   // Давай по новоЙ
                {
                    tavern.choice_1 = "0";
                    i--;
                    if (Travelling.choice_3 == "3")   // Выход из игры
                    {
                        break;
                    }
                }
            }
            if (i == 1)
            {
                if (Travelling.tavern == "1" || Travelling.choice_2 == "1" || Q == 1 || tavern.choice_1 == "1")  // Отправка в таверну через систему путешествий или от путеводного камня
                {
                    Q = 0;
                    tavern.choice_1 = "0";
                    Travelling.tavern = "0";
                    Travelling.choice_2 = "0";
                    /////////////////////////////////////
                    for (size_t p = 0, l = 0; p < 1; p++)
                    {
                        if (l == 0)
                        {
                            Tavern.Trade(); // Торговец
                        }
                        if (l != 0)
                        {
                            l = 0;
                        }
                        if (Tavern.choice_1 == "4") // Характеристики
                        {
                            Tavern.choice_1 = "0";
                            Level.Gold = Tavern.Gold;
                            Level.Working_with_experience();
                            Level.characteristics();
                            if (Level.Back == "1")
                            {
                                Tavern.Back = "1";
                            }
                            else if (Level.Back == "2")
                            {
                                Tavern.Back = "2";
                            }
                        }
                        if (Tavern.Back == "2") // Главный зал
                        {
                            Tavern.Back = "0";
                            q--;
                            Q = 1;
                        }
                        else if (Tavern.Back == "1")
                        {
                            Tavern.Back = "0";
                            p--;
                        }
                    }
                }
            }
        }
    }
}

